Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F29A.tmx
Source language: en_us
Languages: zh_cn

source: Indoor Gardening With Moss
zh_cn: 用翠绿的藓类植物点缀你的居家生活

source: Have you ever walked the many trails and parks in Lane County, particularly during the rainy season and noticed moss covered trees, branches and rocks?
zh_cn: 雨季时节，你是否常在莱恩县的公园或幽深小径中徜徉，是否曾留意过那些被藓类植物所覆盖的树干、枝桠及石块？

source: In a natural setting moss looks quite beautiful. Draped on tree branches it sets a tone of an ancient, almost medieval quality. Along streams and waterfalls, moss creates plush green cushions that accent the water features.
zh_cn: 大自然中的苔藓植物别有一番秀美，经它们点缀的树枝弥漫着中世纪的情调，它们为河流与瀑布绘出了翠绿的底色。

source: What is moss?
zh_cn: 藓纲植物到底是什么？

source: True moss are bryophytes, meaning they have no vascular system or veins to transport nutrients or water.They have no roots to draw nutrients, nor do they flower or seed.
zh_cn: 真正的藓类植物属于苔藓植物门，它们没有运输水分、养分的维管输导组织，也没有吸收养分的复杂的根系系统，不开花，不结种子。

source: Instead, mosses draw nutrients directly through their leaves in a hair-like structure called a rhizoid. Rhizoids adhere to a plants surface.
zh_cn: 藓类植物利用假根依附在大型植物表面，直接通过假根上的叶片吸收养分。

source: Moss colonies often consists of hundreds of tiny plants growing tightly together to form a dense mat.
zh_cn: 藓类植物往往会形成由成百上千个微小个体聚集而成的厚厚的垫状群落。

source: Since moss takes nutrients from the leaves and not the roots, it can grow on living trees without being parasitic or interfering with the trees growth.
zh_cn: 由于藓类植物是通过叶片而不是根系获取营养，因此它在树干上是附生生活而非寄生，不会干扰树木的正常生长。

source: Mosses have two distinct growth forms.
zh_cn: 苔藓植物具有两种截然不同的生活形态。

source: The life cycle begins from a spore that germinates into a thread-like mass called protonema and looks like bright green felt.
zh_cn: 其生命周期从孢子体世代开始，孢子发芽成为翠绿柔软的线状原丝体。

source: This then develops into the gametophore stage that forms stems and leaves.
zh_cn: 原丝体经过发育进入配子体世代形成茎和叶。

source: From the stems, sex organs develop and, after fertilization, spores are formed and carried by the wind to colonize.
zh_cn: 生长在配子体上的生殖器官逐渐发育成熟，完成受精作用，新的孢子就可以随风而去，别处安家。

source: The size and shape of the leaves and length of the stems can vary greatly depending on the moss specie.
zh_cn: 不同种类的藓类植物，其叶片形状、大小及茎的长度有很大差异。

source: What are False Mosses?
zh_cn: 假藓类又是什么呢？

source: The term "moss" is generically used in the nursery trade to describe many short, carpet-like plants.
zh_cn: 在园艺市场中，“藓”可以被用来指代许多种小型垫状植物。

source: Often referred to as "club moss", plants such as Irish moss are highly decorative, but are not true mosses because they have vascular systems and roots.
zh_cn: 其中最为常见的就是“石松”，它形似爱尔兰藓类，在园艺设计中有很好的点缀效果，但它们具有维管系统和根系，因此并不属于苔藓植物。

source: While these types of plants may also be grown in containers, they do not share the same characteristics as mosses.
zh_cn: 虽然这类植物也可以栽培在容器中，但它们与苔藓植物的生理特征并不相同。

source: Taking a good starter portion of moss from the outdoors is simple.
zh_cn: 从户外移植苔藓植株并不困难。

source: Often all that is needed is a handful or two of moss fragments or scrapings.
zh_cn: 通常只需要抓取一把或直接起出几块苔藓群落就可以。

source: If it is possible to take moss intact and still attached to its host, it will enable you to culture the plant more quickly.
zh_cn: 如果可以的话将植物连同其基底（土壤、树皮、岩石块）一起带回，这样以后栽培起来会更快见效。

source: Still, fragments will do just fine.
zh_cn: 当然，用不完整的碎片栽培也可以。

source: There are many woodland areas to find moss, but before taking any plant material from a park be sure to get permission first.
zh_cn: 许多森林中都可以发现苔藓植物，但如果要从公园中采集则请注意不要违反相关规定。

source: If you explain exactly what you are doing there may be no objection, but to avoid the issue take what you can find in your own back yard.
zh_cn: 向管理者说明采集的实际用途，应当不会有人会制止你的行为。当然你也可以在自家后院中仔细观察、就地取材来以避免这些麻烦。

source: Terrariums are simply an enclosed container that holds the soil substrate, wood or rocks, and plants, that is sealed to hold in moisture and humidity.
zh_cn: 只要是一个普通、密封、装有土壤、木质、石块或其它植物生长基质的容器都可以作为栽培小瓶，将其封闭以保持内部环境的湿润。

source: This bodes well for moss since it likes quite a bit of moisture and humidity.
zh_cn: 苔藓喜欢生长在较为湿润的环境中。

source: The container can be just about anything that is clear and has a lid.
zh_cn: 只要是一个干净有盖的杯子就可以作为栽培小瓶。

source: Aquariums, large glass bowls, or any such container, will work as long as you have a lid for it.
zh_cn: 其它容器如鱼缸、大的玻璃碗等，只要有盖都没问题。

source: It is fairly easy to measure and cut a plexi-glass lid to fit any container.
zh_cn: 就算实在找不到合适的盖子，丈量一下瓶口再裁剪制作一个树脂玻璃盖也并不困难。

source: To begin, put a layer of pea size or slightly larger pebbles on the bottom.
zh_cn: 开始栽培时，在容器底部放一层豌豆大的小卵石。

source: This will enable drainage so the soil will not remain over-saturated in water.
zh_cn: 可以用于排水以保证土壤水分不会一直处在过饱和状态。

source: Next add a layer of granulated charcoal.
zh_cn: 第二步是加一层活性炭颗粒。

source: This may be found at aquarium supply stores. The charcoal will help prevent moisture and air from getting stale and smelling bad.
zh_cn: 活性炭可以在水族商店买到，用于防止潮气过重，并且能够吸附异味。

source: Then add a layer of potting soil at least as deep as the other two layers combined. (If you are planting only true moss, then potting soil is not required and sand or some other material may be used.)
zh_cn: 之后再加一层盆栽土，厚度至少要相当于另两层之和（如果你只栽培藓类植物，那么也可以用沙土或者其他基质代替盆栽土）。

source: You can raise the level higher in the back or create hills and valleys to enable the illusion of depth of field.
zh_cn: 可以尝试将土层后部垫高，或者加入一座小山或一个微型河谷以营造出一个有层次有深度的陆地景观。

source: Spritz the soil enough to make it uniformly damp.
zh_cn: 最后在土壤上均匀喷撒足够的水分保持内部湿润。

source: Next comes the fun part- creating a landscape design!
zh_cn: 接下来就是充满趣味的一步——景观设计！

source: Arrange rocks or wood in such a way that is pleasing, shows depth of field and looks like a scene from the forest!
zh_cn: 巧妙地摆布石头可以使你的培养瓶令人愉悦，表现出高低起伏、郁郁葱葱的小型森林景观！

source: Place larger rocks toward the back and smaller ones in the front.
zh_cn: 大块石头放后边，小的摆前边。

source: Leave some open space, or pathways, that lead the eye to look at different areas.
zh_cn: 留出一些裸地、小道，会给带来更丰富的视觉观感。

source: If using stones, from an artistic standpoint it is better to use stones that are uniformly the same type but differ in size.
zh_cn: 如果用石头装饰，从艺术观赏的角度来讲，最好用外形（款式）类似但是大小不一的石头。

source: Manzanita wood is very branchy and thin enough to use in small containers without being visually overbearing.
zh_cn: 还可以引入一些小型多叉的石兰科常绿植物，也不会喧宾夺主。

source: If you are adding other types of plants, do not mix them with moss on soil, particularly grass-like plants, because the plants will quickly overrun the moss.
zh_cn: 需要注意的是，如果你要加入其他种类植物，不要把它们和苔藓一起土栽，特别是草本植物，因为这种植物生长迅速，很快就会遮盖住苔藓植物。

source: Small ferns do well with moss and plants may be placed in separate areas of the landscape.
zh_cn: 小型蕨类和苔藓植物则可以很好地共生，在容器中要将它们和苔藓植物分开摆放。

source: Moss sod or fragments may be laid on the surface of rock or wood or directly on the substrate.
zh_cn: 可以直接将藓类放置在石块、木片或容器基底上。

source: Wrapping it with thin nylon thread or fishing line will keep it in place and the moss will grow over the thread.
zh_cn: 也可以用细尼龙绳或鱼线包裹，这样藓类群落不会散开，并且以后可以沿线附生。

source: If placing moss directly on the substrate, it must be a firm surface.
zh_cn: 如果容器基底表面足够坚固，也可以直接把苔藓放置在上面培养。

source: If your soil is loose or "fluffy" simply press it down to firm it.
zh_cn: 土壤松垮的话要先压实。

source: There is also a method reported on the internet of creating a moss slurry by adding moss and yogurt, or beer, to a blender and then painting the slurry onto the surface.
zh_cn: 网上也有参考，教大家把藓类和酸奶或啤酒搅拌在一起制成一种苔藓泥浆，而后把泥浆喷洒到附生基质上就可以了。

source: The solution should be thick enough so it will not drip off.
zh_cn: 为了保证泥浆可以成功固着在基底表面而不会迅速淌干，溶液需要黏稠一些。

source: The beer or yogurt feeds the moss fragments in the slurry until it grows into a mat and is well secured on the wood or rock.
zh_cn: 啤酒或酸奶可以为藓类植物提供营养助其发育成紧密成群的垫状群落。

source: After everything is in place, mist all the plants and surface area and put on the lid.
zh_cn: 万事具备之后，将植物和容器喷洒湿润，最后盖上盖子就完工了。

source: Light is the most critical factor for growing plants.
zh_cn: 光是植物生长的关键因子。

source: In the case of moss, too much light is the greatest enemy.
zh_cn: 对藓类植物来说，光照过强却不是什么好事。

source: A few hours of morning sun will help the moss to color up more intensely and full afternoon sun will most likely kill it.
zh_cn: 短短几个小时的晨曦就足以帮助藓类植物茁壮成长，而一整个下午的暴晒却可能会将其置于死地。

source: Moss prefers cool damp air and partial light.
zh_cn: 藓类植物更加适应凉爽湿润的空气和微弱的光照环境。

source: In the summertime keep it away from extreme heat.
zh_cn: 盛夏时节要注意避免温度过高。

source: Indirect sunlight would be the best or a simple artificial light such as a desktop fluorescent that is not too close, (12 inches or more above the terrarium).
zh_cn: 可以为植物提供散射光线或使用荧光灯等人工光源，将其放置在较远的距离（至少高于培养容器12英寸）。

source: A very low wattage light can aid in being able to visually see the terrarium better without adding much to the overhead light or window light (such as a cabinet display light) and could be positioned behind the terrarium or at the base, which would create better viewing without shining light directly onto the plants.
zh_cn: 采用低功率的光源照射，不要使用用顶灯或窗灯（如橱窗灯），可以得到更好的观赏效果，将光源放置在容器后或基部，可以避免过量的光照。

source: Mosses may also be grown indoors in open dish-type garden containers.
zh_cn: 藓类植物也可以栽培在室内花盆中。

source: The same layered substrate is used and the only difference is it will require daily misting to keep the plants moist and humid.
zh_cn: 用同样的附着基底来培养就可以，唯一需要注意的是每天喷水以保持植物体的潮湿润泽。

source: With some creativity you too can take a living snapshot of the deep forest and bring it into your home to enjoy.
zh_cn: 多点创造力，发挥想象力，你就可以把大自然的景致收到瓶子中，带回家慢慢欣赏。
